sink/openupdate/src/test/resources/mappings/mapping-CatalogingUpdateServices-UpdateService-ValidationError.json

{
  "request" : {
    "url" : "/CatalogingUpdateServices/UpdateService",
    "method" : "POST",
    "bodyPatterns" : [ {
      "equalToXml" : "<?xml version=\"1.0\" ?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><updateRecord xmlns=\"http://oss.dbc.dk/ns/catalogingUpdate\"><updateRecordRequest><authentication><groupIdAut>010100</groupIdAut><passwordAut>testPassword</passwordAut><userIdAut>userTestId</userIdAut></authentication><schemaName>dbc</schemaName><bibliographicRecord><recordSchema>info:lc/xmlns/marcxchange-v1</recordSchema><recordPacking>xml</recordPacking><recordData><marcx:record xmlns:marcx=\"info:lc/xmlns/marcxchange-v1\">\n    <marcx:leader>00000c    2200000   4500</marcx:leader>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"001\">\n      <marcx:subfield code=\"a\">D969866622</marcx:subfield>\n      <marcx:subfield code=\"f\">a</marcx:subfield>\n      <marcx:subfield code=\"o\">d</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"004\">\n      <marcx:subfield code=\"r\">c</marcx:subfield>\n      <marcx:subfield code=\"a\">e</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"008\">\n      <marcx:subfield code=\"t\">m</marcx:subfield>\n      <marcx:subfield code=\"u\">r</marcx:subfield>\n      <marcx:subfield code=\"a\">1948</marcx:subfield>\n      <marcx:subfield code=\"z\">1957</marcx:subfield>\n      <marcx:subfield code=\"b\">gb</marcx:subfield>\n      <marcx:subfield code=\"v\">1</marcx:subfield>\n      <marcx:subfield code=\"l\">eng</marcx:subfield>\n      <marcx:subfield code=\"&amp;\">2</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"009\">\n      <marcx:subfield code=\"a\">a</marcx:subfield>\n      <marcx:subfield code=\"g\">xx</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"041\">\n      <marcx:subfield code=\"a\">eng</marcx:subfield>\n      <marcx:subfield code=\"c\">fre</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"088\">\n      <marcx:subfield code=\"a\">840SART1</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"096\">\n      <marcx:subfield code=\"a\">1</marcx:subfield>\n      <marcx:subfield code=\"b\">se: 9780413776396</marcx:subfield>\n      <marcx:subfield code=\"c\">b</marcx:subfield>\n      <marcx:subfield code=\"z\">820040</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"100\">\n      <marcx:subfield code=\"a\">Sartre</marcx:subfield>\n      <marcx:subfield code=\"h\">Jean-Paul</marcx:subfield>\n      <marcx:subfield code=\"c\">1905-1980</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"241\">\n      <marcx:subfield code=\"a\">Existentialisme est un humanisme</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"245\">\n      <marcx:subfield code=\"a\">Existentialism and humanism</marcx:subfield>\n      <marcx:subfield code=\"e\">Jean-Paul Sartre</marcx:subfield>\n      <marcx:subfield code=\"e\">translation and introduction by Philip Mairet</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"260\">\n      <marcx:subfield code=\"a\">London</marcx:subfield>\n      <marcx:subfield code=\"b\">Methuen</marcx:subfield>\n      <marcx:subfield code=\"c\">1957</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"300\">\n      <marcx:subfield code=\"a\">70 s.</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\">\n      <marcx:subfield code=\"a\">20070501</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\">\n      <marcx:subfield code=\"a\">kat061221</marcx:subfield>\n      <marcx:subfield code=\"a\">gave</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\">\n      <marcx:subfield code=\"a\">sle090713 bortk.</marcx:subfield>\n    </marcx:datafield>\n    <marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"590\">\n      <marcx:subfield code=\"a\">genoplivet151013</marcx:subfield>\n    </marcx:datafield>\n  </marcx:record></recordData><extraRecordData></extraRecordData></bibliographicRecord><trackingId>efd0db60-87db-40c8-8b0f-2c164ce49dfc</trackingId></updateRecordRequest></updateRecord></S:Body></S:Envelope>"
    } ]
  },
  "response" : {
    "status" : 200,
    "bodyFileName" : "body-CatalogingUpdateServices-UpdateService-ValidationError.json",
    "headers" : {
      "Server" : "grizzly/2.3.1",
      "Content-Type" : "text/xml;charset=utf-8",
      "Date" : "Tue, 03 Nov 2015 14:14:21 GMT",
      "Transfer-Encoding" : "chunked"
    }
  }
}